Revit 2027 API
Subelement.CanHaveTypeAssigned Method
 Identifies if the subelement can have a type assigned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanHaveTypeAssigned()
Public Function CanHaveTypeAssigned As Boolean
public:
bool CanHaveTypeAssigned()
member CanHaveTypeAssigned : unit -> bool
Return Value
Boolean
 True if subelement can have a type assigned, false otherwise.
Remarks
 Some subelements cannot have type assigned, in which case invalid element id is considered to be their type id.
See Also
Reference
Subelement Class
Autodesk.Revit.DB Namespace